package edu.javaRushCourse.JavaSyntax.level1.lesson4;

/**
 * Объяви переменные a, b типа int.
 * Сразу же в строке объявления присвой им разные значения.
 * Значениями могут быть любые целые числа.
 *
 * Требования:
 * •	Объяви две переменные типа int.
 * •	Имена переменных должны быть a и b.
 * •	Переменным сразу должны быть присвоены значения.
 * •	Переменные a и b должны иметь разные значения.
 */
public class Task6 {
    public static void main(String[] args) {
        int a = 5;
        int b = 10;
    }
}
