package edu.javaRushCourse.JavaSyntax.level1.lesson2;

/**
 * Напиши программу, которая выводит на экран надпись: "Диего + Амиго = Друзья".
 *      Программа должна выводить текст.
 * •	Текст должен начинаться с "Диего".
 * •	Текст должен заканчиваться на "Друзья".
 * •	Текст должен состоять из 22 символов, включая пробелы.
 * •	Выводимый текст должен соответствовать заданию.
 */
public class Task1 {
    public static void main(String[] args) {
        System.out.println("Диего + Амиго = Друзья");
    }
}
