package edu.javaRushCourse.JavaSyntax.level8.lesson1;

/**
 * Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
 * Этим переменным присвой максимально возможное для них значение.
 * Никаких методов создавать не нужно.
 *
 * Требования:
 * •	В классе Solution должны быть созданы переменные всех примитивных целочисленных типов.
 * •	Всем целочисленным переменным должно быть присвоено максимально возможное для них значение.
 * •	В классе Solution не должно быть создано никаких методов.
 */
public class Task146 {
    byte b = 127;
    short sh = 32767;
    int i = 2147483647;
    long l = 9223372036854775807L;
}
