package edu.javaRushCourse.JavaSyntax.level8.lesson1;

/**
 * Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
 * Этим переменным присвой минимально возможное для них значение.
 * Никаких методов создавать не нужно.
 *
 * Требования:
 * •	В классе Solution должны быть созданы переменные всех примитивных целочисленного типов.
 * •	Всем целочисленным переменным должно быть присвоено минимально возможное для них значение.
 * •	В классе Solution не должно быть создано никаких методов.
 */
public class Task147 {
    byte b = -128;
    short sh = -32768;
    int i = -2147483648;
    long l = -9223372036854775808L;

}
